particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
/*
 * Copyright (c) 2018 Particle Industries, Inc.  All rights reserved.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation, either
 * version 3 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, see <http://www.gnu.org/licenses/>.
 */

#include "logging.h"
LOG_SOURCE_CATEGORY("hal.ble")

/* Headers included from nRF5_SDK/components/softdevice/s140/headers */
#include "ble.h"
#include "ble_gap.h"
#include "ble_gatt.h"
#include "ble_gatts.h"
#include "ble_gattc.h"
#include "ble_types.h"
/* Headers included from nRF5_SDK/components/softdevice/common */
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_sdh_soc.h"

#include "app_util.h"

#include "concurrent_hal.h"
#include "static_recursive_mutex.h"
#include <mutex>

#include "gpio_hal.h"
#include "ble_hal.h"
#include "system_error.h"
#include "sdk_config_system.h"

#include <string.h>


#define BLE_CONN_CFG_TAG                            1
#define BLE_OBSERVER_PRIO                           1

#define BLE_ADV_DATA_ADVERTISING                    0
#define BLE_ADV_DATA_SCAN_RESPONSE                  1

#define BLE_DISCOVERY_PROCEDURE_IDLE                0x00
#define BLE_DISCOVERY_PROCEDURE_SERVICES            0x01
#define BLE_DISCOVERY_PROCEDURE_CHARACTERISTICS     0x02
#define BLE_DISCOVERY_PROCEDURE_DESCRIPTORS         0x03

#define BLE_GENERAL_PROCEDURE_TIMEOUT            	5000 // In milliseconds
#define BLE_DICOVERY_PROCEDURE_TIMEOUT				15000 // In milliseconds


StaticRecursiveMutex s_bleMutex;

class bleLock {
    static void lock() {
        s_bleMutex.lock();
    }

    static void unlock() {
        s_bleMutex.unlock();
    }
};

typedef enum {
    BLE_GAP_ADV_STOPPED = 0x00,
    BLE_GAP_SCAN_RESULT = 0x01,
    BLE_GAP_SCAN_STOPPED = 0x02,
    BLE_GAP_CONNECTED = 0x03,
    BLE_GAP_DISCONNECTED = 0x04,
    BLE_GAP_CONN_PARAMS_UPDATED = 0x05,

    BLE_GATT_CLIENT_SERVICES_DISCOVERED = 0x10,
    BLE_GATT_CLIENT_CHARACTERISTICS_DISCOVERED = 0x11,
    BLE_GATT_CLIENT_DESCRIPTORS_DISCOVERED = 0x12,
    BLE_GATT_CLIENT_DATA_RECEIVED = 0x13,

    BLE_GATT_SERVER_DATA_RECEIVED = 0x20,
} HalBleEvtType_t;

typedef void (*evt_handler_t)(void*);

typedef struct {
    HalBleEvtType_t type;
    evt_handler_t   handler;
    union {
        hal_ble_gap_on_advertising_stopped_evt_t gapOnAdvStoppedEvt;
        hal_ble_gap_on_scan_result_evt_t gapOnScanResultEvt;
        hal_ble_gap_on_scan_stopped_evt_t gapOnScanStoppedEvt;
        hal_ble_gap_on_connected_evt_t gapOnConnectedEvt;
        hal_ble_gap_on_disconnected_evt_t gapOnDisconnectedEvt;
        hal_ble_gap_on_connection_parameters_updated_evt_t gapOnConnParamsUpdatedEvt;
        hal_ble_gatt_server_on_data_received_evt_t gattServerOnDataRecEvt;
        hal_ble_gatt_client_on_services_discovered_evt_t gattClientOnServicesDiscoveredEvt;
        hal_ble_gatt_client_on_characteristics_discovered_evt_t gattClientOnCharacteristicsDiscoveredEvt;
        hal_ble_gatt_client_on_descriptors_discovered_evt_t gattClientOnDescriptorsDiscoveredEvt;
        hal_ble_gatt_client_on_data_received_evt_t gattClientOnDataRecEvt;
    } arg;
} HalBleEvtMsg_t;

typedef struct {
    uint16_t                 discStartHandle;
    uint16_t                 discEndHandle;
    hal_ble_service_t        services[BLE_MAX_SVC_COUNT];
    hal_ble_characteristic_t characteristics[BLE_MAX_CHAR_COUNT];
    hal_ble_descriptor_t     descriptors[BLE_MAX_DESC_COUNT];
    uint8_t                  discAll : 1;
    uint8_t                  count;
    uint8_t                  currIndex;
    uint8_t                  currDiscProcedure;
    os_semaphore_t           semaphore;
} HalBleDiscovery_t;

// TODO: used when muti-role is implemented
typedef struct {
    uint16_t connHandles[BLE_MAX_LINK_COUNT];
    hal_ble_address_t peerAddrs[BLE_MAX_LINK_COUNT];
} HalBleConnections_t;

/* BLE Instance */
typedef struct {
    uint8_t  initialized  : 1;
    uint8_t  advertising  : 1;
    uint8_t  scanning     : 1;
    uint8_t  connecting   : 1;
    uint8_t  discovering  : 1;
    uint8_t  connected    : 1;
    int8_t   txPower;
    uint8_t  role;
    uint16_t connHandle;
    uint8_t  advHandle;
    uint8_t  connParamsUpdateAttempts;

    hal_ble_scan_parameters_t        scanParams;
    hal_ble_advertising_parameters_t advParams;
    hal_ble_connection_parameters_t  ppcp;

    uint8_t  advData[BLE_MAX_ADV_DATA_LEN];
    uint16_t advDataLen;
    uint8_t  scanRespData[BLE_MAX_ADV_DATA_LEN];
    uint16_t scanRespDataLen;

    os_semaphore_t connectSemaphore;
    os_semaphore_t disconnectSemaphore;
    os_semaphore_t connUpdateSemaphore;
    os_semaphore_t discoverySemaphore;
    os_semaphore_t readWriteSemaphore;
    os_queue_t     evtQueue;
    os_thread_t    evtThread;
    os_timer_t     connParamsUpdateTimer;

    ble_gap_on_advertising_stopped_callback_t gapOnAdvStoppedCb;
    ble_gap_on_scan_result_callback_t gapOnScanResultCb;
    ble_gap_on_scan_stopped_callback_t gapOnScanStoppedCb;
    ble_gap_on_connected_callback_t gapOnConnectedCb;
    ble_gap_on_disconnected_callback_t gapOnDisconnectedCb;
    ble_gap_on_connection_parameters_updated_callback_t gapOnConnParamsUpdatedCb;
    ble_gatt_server_on_data_received_callback_t gattServerOnDataRecCb;
    ble_gatt_client_on_services_discovered_callback_t gattClientOnServicesDiscoveredCb;
    ble_gatt_client_on_characteristics_discovered_callback_t gattClientOnCharacteristicsDiscoveredCb;
    ble_gatt_client_on_descriptors_discovered_callback_t gattClientOnDescriptorsDiscoveredCb;
    ble_gatt_client_on_data_received_callback_t gattClientOnDataRecCb;

    hal_ble_address_t     peer_addr;
    hal_ble_connection_parameters_t effectiveConnParams;
    ble_gap_addr_t        whitelist[BLE_MAX_WHITELIST_ADDR_COUNT];
    ble_gap_addr_t const* whitelistPointer[BLE_MAX_WHITELIST_ADDR_COUNT];

    HalBleDiscovery_t     discovery;
} HalBleInstance_t;


static HalBleInstance_t s_bleInstance = {
    .initialized  = 0,
    .advertising  = 0,
    .scanning     = 0,
    .connecting   = 0,
    .discovering  = 0,
    .connected    = 0,
    .txPower      = 0,
    .role         = BLE_ROLE_INVALID,
    .connHandle   = BLE_INVALID_CONN_HANDLE,
    .advHandle    = BLE_GAP_ADV_SET_HANDLE_NOT_SET,
    .connParamsUpdateAttempts = 0,

