particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
static int fromHalConnParams(const hal_ble_connection_parameters_t* halConnParams, ble_gap_conn_params_t* connParams) {
    if (halConnParams == NULL || connParams == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    memset(connParams, 0x00, sizeof(ble_gap_conn_params_t));

    connParams->min_conn_interval = halConnParams->min_conn_interval;
    connParams->max_conn_interval = halConnParams->max_conn_interval;
    connParams->slave_latency     = halConnParams->slave_latency;
    connParams->conn_sup_timeout  = halConnParams->conn_sup_timeout;

    return SYSTEM_ERROR_NONE;
}

static int toHalConnParams(const ble_gap_conn_params_t* connParams, hal_ble_connection_parameters_t* halConnParams) {
    if (halConnParams == NULL || connParams == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    memset(halConnParams, 0x00, sizeof(hal_ble_connection_parameters_t));

    halConnParams->min_conn_interval = connParams->min_conn_interval;
    halConnParams->max_conn_interval = connParams->max_conn_interval;
    halConnParams->slave_latency = connParams->slave_latency;
    halConnParams->conn_sup_timeout = connParams->conn_sup_timeout;

    return SYSTEM_ERROR_NONE;
}

static int fromHalUuid(const hal_ble_uuid_t* halUuid, ble_uuid_t* uuid) {
    if (uuid == NULL || halUuid == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    if (halUuid->type == BLE_UUID_TYPE_128BIT) {
        ble_uuid128_t uuid128;
        memcpy(uuid128.uuid128, halUuid->uuid128, BLE_SIG_UUID_128BIT_LEN);

        ret_code_t ret = sd_ble_uuid_vs_add(&uuid128, &uuid->type);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "sd_ble_uuid_vs_add() failed: %u", (unsigned)ret);
            return sysError(ret);
        }

        ret = sd_ble_uuid_decode(BLE_SIG_UUID_128BIT_LEN, halUuid->uuid128, uuid);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "sd_ble_uuid_decode() failed: %u", (unsigned)ret);
            return sysError(ret);
        }
    }
    else if (halUuid->type == BLE_UUID_TYPE_16BIT) {
        uuid->type = BLE_UUID_TYPE_BLE;
        uuid->uuid = halUuid->uuid16;
    }
    else {
        uuid->type = BLE_UUID_TYPE_UNKNOWN;
        uuid->uuid = halUuid->uuid16;
    }

    return SYSTEM_ERROR_NONE;
}

static int toHalUuid(const ble_uuid_t* uuid, hal_ble_uuid_t* halUuid) {
    if (uuid == NULL || halUuid == NULL) {
        return SYSTEM_ERROR_INVALID_ARGUMENT;
    }

    if (uuid->type == BLE_UUID_TYPE_BLE) {
        halUuid->type = BLE_UUID_TYPE_16BIT;
        halUuid->uuid16 = uuid->uuid;
        return SYSTEM_ERROR_NONE;
    }
    else if (uuid->type != BLE_UUID_TYPE_UNKNOWN) {
        uint8_t uuidLen;
        halUuid->type = BLE_UUID_TYPE_128BIT;
        ret_code_t ret = sd_ble_uuid_encode(uuid, &uuidLen, halUuid->uuid128);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "sd_ble_uuid_encode() failed: %u", (unsigned)ret);
            halUuid->type = BLE_UUID_TYPE_128BIT_SHORTED;
            halUuid->uuid16 = uuid->uuid;
            return sysError(ret);
        }
        return SYSTEM_ERROR_NONE;
    }

    halUuid->type = BLE_UUID_TYPE_128BIT_SHORTED;
    halUuid->uuid16 = uuid->uuid;

    return SYSTEM_ERROR_UNKNOWN;
}

static uint8_t toHalCharacteristicProperties(ble_gatt_char_props_t properties) {
    uint8_t halProperties = 0;

    if (properties.broadcast)      halProperties |= BLE_SIG_CHAR_PROP_BROADCAST;
    if (properties.read)           halProperties |= BLE_SIG_CHAR_PROP_READ;
    if (properties.write_wo_resp)  halProperties |= BLE_SIG_CHAR_PROP_WRITE_WO_RESP;
    if (properties.write)          halProperties |= BLE_SIG_CHAR_PROP_WRITE;
    if (properties.notify)         halProperties |= BLE_SIG_CHAR_PROP_NOTIFY;
    if (properties.indicate)       halProperties |= BLE_SIG_CHAR_PROP_INDICATE;
    if (properties.auth_signed_wr) halProperties |= BLE_SIG_CHAR_PROP_AUTH_SIGN_WRITES;

    return halProperties;
}

static void fromHalCharacteristicProperties(uint8_t halProperties, ble_gatt_char_props_t* properties) {
    properties->broadcast      = (halProperties & BLE_SIG_CHAR_PROP_BROADCAST) ? 1 : 0;
    properties->read           = (halProperties & BLE_SIG_CHAR_PROP_READ) ? 1 : 0;
    properties->write_wo_resp  = (halProperties & BLE_SIG_CHAR_PROP_WRITE_WO_RESP) ? 1 : 0;
    properties->write          = (halProperties & BLE_SIG_CHAR_PROP_WRITE) ? 1 : 0;
    properties->notify         = (halProperties & BLE_SIG_CHAR_PROP_NOTIFY) ? 1 : 0;
    properties->indicate       = (halProperties & BLE_SIG_CHAR_PROP_INDICATE) ? 1 : 0;
    properties->auth_signed_wr = (halProperties & BLE_SIG_CHAR_PROP_AUTH_SIGN_WRITES) ? 1 : 0;
}

static bool isConnParamsFeeded(hal_ble_connection_parameters_t* connParams) {
    hal_ble_connection_parameters_t ppcp;

    if (ble_gap_get_ppcp(&ppcp, NULL) == SYSTEM_ERROR_NONE) {
        uint16_t minAcceptedSl = ppcp.slave_latency - MIN(BLE_CONN_PARAMS_SLAVE_LATENCY_ERR, ppcp.slave_latency);
        uint16_t maxAcceptedSl = ppcp.slave_latency + BLE_CONN_PARAMS_SLAVE_LATENCY_ERR;
        uint16_t minAcceptedTo = ppcp.conn_sup_timeout - MIN(BLE_CONN_PARAMS_TIMEOUT_ERR, ppcp.conn_sup_timeout);
        uint16_t maxAcceptedTo = ppcp.conn_sup_timeout + BLE_CONN_PARAMS_TIMEOUT_ERR;

        if (connParams->max_conn_interval < ppcp.min_conn_interval ||
                connParams->max_conn_interval > ppcp.max_conn_interval) {
            return false;
        }
        if (connParams->slave_latency < minAcceptedSl ||
                connParams->slave_latency > maxAcceptedSl) {
            return false;
        }
        if (connParams->conn_sup_timeout < minAcceptedTo ||
                connParams->conn_sup_timeout > maxAcceptedTo) {
            return false;
        }
    }

    return true;
}

static void connParamsUpdateTimerCb(os_timer_t timer) {
    if (s_bleInstance.connHandle == BLE_INVALID_CONN_HANDLE) {
        return;
    }

    hal_ble_connection_parameters_t ppcp;
    if (ble_gap_get_ppcp(&ppcp, NULL) == SYSTEM_ERROR_NONE) {
        int ret = ble_gap_update_connection_params(s_bleInstance.connHandle, &ppcp, NULL);
        if (ret == SYSTEM_ERROR_NONE) {
            s_bleInstance.connParamsUpdateAttempts++;
            return;
        }
    }

    ret_code_t ret = sd_ble_gap_disconnect(s_bleInstance.connHandle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gap_disconnect() failed: %u", (unsigned)ret);
        return;
    }
    LOG_DEBUG(TRACE, "Disconnecting. Update BLE connection parameters failed.");
}

// Only used for BLE Peripheral
static void updateConnParamsIfNeeded(void) {
    if (s_bleInstance.role == BLE_ROLE_PERIPHERAL && !isConnParamsFeeded(&s_bleInstance.effectiveConnParams)) {
        if (s_bleInstance.connParamsUpdateAttempts < BLE_CONN_PARAMS_UPDATE_ATTEMPS) {
            if (s_bleInstance.connParamsUpdateTimer != NULL) {
                if (!os_timer_change(s_bleInstance.connParamsUpdateTimer, OS_TIMER_CHANGE_START, true, 0, 0, NULL)) {
                    LOG_DEBUG(TRACE, "Attempts to update BLE connection parameters, try: %d after %d ms",
                            s_bleInstance.connParamsUpdateAttempts, BLE_CONN_PARAMS_UPDATE_DELAY_MS);
                    return;
                }
            }
        }

        ret_code_t ret = sd_ble_gap_disconnect(s_bleInstance.connHandle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        if (ret != NRF_SUCCESS) {
            LOG(ERROR, "sd_ble_gap_disconnect() failed: %u", (unsigned)ret);
            return;
        }
        LOG_DEBUG(TRACE, "Disconnecting. Update BLE connection parameters failed.");
    }
}

static int addService(uint8_t type, const ble_uuid_t* uuid, uint16_t* handle) {
    ret_code_t ret;
    ret = sd_ble_gatts_service_add(type, uuid, handle);
    if (ret != NRF_SUCCESS) {
        LOG(ERROR, "sd_ble_gatts_service_add() failed: %u", (unsigned)ret);
        return sysError(ret);
    }

    LOG_DEBUG(TRACE, "Service handle: %d.", *handle);

    return SYSTEM_ERROR_NONE;
}

static int addCharacteristic(uint16_t svcHandle, const ble_uuid_t* uuid, uint8_t properties,
                             const char* description, hal_ble_characteristic_t* characteristic) {
    ret_code_t               ret;
    ble_gatts_char_md_t      charMd;
    ble_gatts_attr_md_t      valueAttrMd;
    ble_gatts_attr_md_t      userDescAttrMd;
    ble_gatts_attr_md_t      cccdAttrMd;
    ble_gatts_attr_t         charValueAttr;
    ble_gatts_char_handles_t charHandles;

