particle-iot/device-os/hal/src/nRF52840/ble_hal.cpp
            bool terminate = true;
            if ( (event->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_SUCCESS)
              && (s_bleInstance.discovery.currDiscProcedure == BLE_DISCOVERY_PROCEDURE_DESCRIPTORS) ) {
                for (uint8_t i = 0; i < descCount; i++) {
                    // It will report all attributes with 16-bits UUID, filter descriptors.
                    switch (event->evt.gattc_evt.params.desc_disc_rsp.descs[i].uuid.uuid) {
                        case BLE_SIG_UUID_CHAR_EXTENDED_PROPERTIES_DESC:
                        case BLE_SIG_UUID_CHAR_USER_DESCRIPTION_DESC:
                        case BLE_SIG_UUID_CLIENT_CHAR_CONFIG_DESC:
                        case BLE_SIG_UUID_SERVER_CHAR_CONFIG_DESC:
                        case BLE_SIG_UUID_CHAR_PRESENT_FORMAT_DESC:
                        case BLE_SIG_UUID_CHAR_AGGREGATE_FORMAT: {
                            s_bleInstance.discovery.descriptors[s_bleInstance.discovery.count].handle = event->evt.gattc_evt.params.desc_disc_rsp.descs[i].handle;
                            toHalUuid(&event->evt.gattc_evt.params.desc_disc_rsp.descs[i].uuid, &s_bleInstance.discovery.descriptors[s_bleInstance.discovery.count].uuid);
                            s_bleInstance.discovery.count++;
                        }
                        default: break;
                    }
                    if (s_bleInstance.discovery.count >= BLE_MAX_DESC_COUNT) {
                        break;
                    }
                }

                uint16_t currEndHandle = event->evt.gattc_evt.params.desc_disc_rsp.descs[descCount-1].handle;
                if ( (currEndHandle < s_bleInstance.discovery.discEndHandle)
                  && (s_bleInstance.discovery.count < BLE_MAX_DESC_COUNT) ) {
                    ble_gattc_handle_range_t handleRange;
                    handleRange.start_handle = currEndHandle + 1;
                    handleRange.end_handle   = s_bleInstance.discovery.discEndHandle;
                    ret = sd_ble_gattc_descriptors_discover(event->evt.gattc_evt.conn_handle, &handleRange);
                    if (ret != NRF_SUCCESS) {
                        LOG(ERROR, "sd_ble_gattc_descriptors_discover() failed: %u", (unsigned)ret);
                    }
                    else {
                        terminate = false;
                    }
                }
            }
            else {
                LOG(ERROR, "BLE characteristic discovery failed: %d, handle: %d.", event->evt.gattc_evt.gatt_status, event->evt.gattc_evt.error_handle);
            }

            if (terminate) {
                if (s_bleInstance.gattClientOnDescriptorsDiscoveredCb != NULL) {
                    msg.type = BLE_GATT_CLIENT_DESCRIPTORS_DISCOVERED;
                    msg.handler = (evt_handler_t)s_bleInstance.gattClientOnDescriptorsDiscoveredCb;
                    msg.arg.gattClientOnDescriptorsDiscoveredEvt.version = 0x01;
                    msg.arg.gattClientOnDescriptorsDiscoveredEvt.conn_handle = event->evt.gattc_evt.conn_handle;
                    msg.arg.gattClientOnDescriptorsDiscoveredEvt.count = s_bleInstance.discovery.count;
                    msg.arg.gattClientOnDescriptorsDiscoveredEvt.descriptors = s_bleInstance.discovery.descriptors;
                    if (os_queue_put(s_bleInstance.evtQueue, &msg, 0, NULL)) {
                        LOG(ERROR, "os_queue_put() failed.");
                        // This flag should be cleared after this event being popped, in case that
                        // further operation is needed to retrieve 128-bits UUID. If this event is
                        // not enqueued successfully, this flag should be clear here.
                        s_bleInstance.discovery.currDiscProcedure = BLE_DISCOVERY_PROCEDURE_IDLE;
                        s_bleInstance.discovering = false;
                        os_semaphore_give(s_bleInstance.discoverySemaphore, false);
                    }
                }
            }
        } break;

        case BLE_GATTC_EVT_READ_RSP: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: read response.");

            if (event->evt.gattc_evt.gatt_status == BLE_GATT_STATUS_SUCCESS) {
                if (s_bleInstance.discovering) {
                    if ( (s_bleInstance.discovery.currDiscProcedure == BLE_DISCOVERY_PROCEDURE_SERVICES)
                      && (event->evt.gattc_evt.params.read_rsp.handle == s_bleInstance.discovery.services[s_bleInstance.discovery.currIndex].start_handle) ) {
                        s_bleInstance.discovery.services[s_bleInstance.discovery.currIndex].uuid.type = BLE_UUID_TYPE_128BIT;
                        memcpy(s_bleInstance.discovery.services[s_bleInstance.discovery.currIndex].uuid.uuid128, event->evt.gattc_evt.params.read_rsp.data, BLE_SIG_UUID_128BIT_LEN);
                        os_semaphore_give(s_bleInstance.discovery.semaphore, false);
                    }
                    else if ( (s_bleInstance.discovery.currDiscProcedure == BLE_DISCOVERY_PROCEDURE_CHARACTERISTICS)
                           && (event->evt.gattc_evt.params.read_rsp.handle == s_bleInstance.discovery.characteristics[s_bleInstance.discovery.currIndex].decl_handle) ) {
                        s_bleInstance.discovery.characteristics[s_bleInstance.discovery.currIndex].uuid.type = BLE_UUID_TYPE_128BIT;
                        // The offset of Characteristic UUID in the Characteristic declaration attribute is 3.
                        memcpy(s_bleInstance.discovery.characteristics[s_bleInstance.discovery.currIndex].uuid.uuid128, &event->evt.gattc_evt.params.read_rsp.data[3], BLE_SIG_UUID_128BIT_LEN);
                        os_semaphore_give(s_bleInstance.discovery.semaphore, false);
                    }
                }
                else {
                    if (s_bleInstance.gattClientOnDataRecCb != NULL) {
                        msg.type = BLE_GATT_CLIENT_DATA_RECEIVED;
                        msg.handler = (evt_handler_t)s_bleInstance.gattClientOnDataRecCb;
                        msg.arg.gattClientOnDataRecEvt.version = 0x01;
                        msg.arg.gattClientOnDataRecEvt.conn_handle = event->evt.gattc_evt.conn_handle;
                        msg.arg.gattClientOnDataRecEvt.peer_attr_handle = event->evt.gattc_evt.params.read_rsp.handle;
                        msg.arg.gattClientOnDataRecEvt.offset = event->evt.gattc_evt.params.read_rsp.offset;
                        msg.arg.gattClientOnDataRecEvt.data_len = event->evt.gattc_evt.params.read_rsp.len;
                        memcpy(msg.arg.gattClientOnDataRecEvt.data, event->evt.gattc_evt.params.read_rsp.data, msg.arg.gattClientOnDataRecEvt.data_len);
                        if (os_queue_put(s_bleInstance.evtQueue, &msg, 0, NULL)) {
                            LOG(ERROR, "os_queue_put() failed.");
                        }
                    }
                    os_semaphore_give(s_bleInstance.readWriteSemaphore, false);
                }
            }
            else {
                LOG(ERROR, "BLE read characteristic failed: %d, handle: %d.", event->evt.gattc_evt.gatt_status, event->evt.gattc_evt.error_handle);
            }
        } break;

        case BLE_GATTC_EVT_WRITE_RSP: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: write with response completed.");
            os_semaphore_give(s_bleInstance.readWriteSemaphore, false);
        } break;

        case BLE_GATTC_EVT_WRITE_CMD_TX_COMPLETE: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: write without response completed.");
            os_semaphore_give(s_bleInstance.readWriteSemaphore, false);
        } break;

        case BLE_GATTC_EVT_HVX: {
            LOG_DEBUG(TRACE, "BLE GATT Client event: data received. conn_handle: %d, attr_handle: %d, len: %d, type: %d",
                    event->evt.gattc_evt.conn_handle, event->evt.gattc_evt.params.hvx.handle,
                    event->evt.gattc_evt.params.hvx.len, event->evt.gattc_evt.params.hvx.type);

            if (event->evt.gattc_evt.params.hvx.type == BLE_GATT_HVX_INDICATION) {
                ret = sd_ble_gattc_hv_confirm(event->evt.gattc_evt.conn_handle, event->evt.gattc_evt.params.hvx.handle);
                if (ret != NRF_SUCCESS) {
                    LOG(ERROR, "sd_ble_gattc_hv_confirm() failed: %u", (unsigned)ret);
                }
            }

